Tekla.Structures.Model.ReferenceModel.Revision
Reference model revision.

Tekla.Structures.Model.ReferenceModel.Revision.#ctor(System.Int32,System.Int32,System.DateTime,System.String,System.String,System.Boolean)
Parameterized constructor.

Tekla.Structures.Model.ReferenceModel.Revision.ReferenceModelId
Gets or sets the parent reference model id.
The reference model id.

Tekla.Structures.Model.ReferenceModel.Revision.Id
Gets the revision id.
The revision id.

Tekla.Structures.Model.ReferenceModel.Revision.Time
Gets the revision time.
The revision time.

Tekla.Structures.Model.ReferenceModel.Revision.Hash
Gets the revision hash identifier.
The revision hash.

Tekla.Structures.Model.ReferenceModel.Revision.FileName
Gets the revision file name.
The revision file name.

Tekla.Structures.Model.ReferenceModel.Revision.IsCurrentRevision
Gets the value indicating whether this revision is the current revision or not.
The currentness of the revision.